jmeter/report/statistics.json
{
  "推荐列表-压力" : {
    "transaction" : "推荐列表-压力",
    "sampleCount" : 500,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 50.331999999999994,
    "medianResTime" : 10.0,
    "minResTime" : 3.0,
    "maxResTime" : 1131.0,
    "pct1ResTime" : 90.0,
    "pct2ResTime" : 113.84999999999997,
    "pct3ResTime" : 850.0500000000009,
    "throughput" : 102.6904908605463,
    "receivedKBytesPerSec" : 402.63898516122407,
    "sentKBytesPerSec" : 15.343403419593347
  },
  "推荐列表-基准" : {
    "transaction" : "推荐列表-基准",
    "sampleCount" : 50,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 50.980000000000004,
    "medianResTime" : 11.0,
    "minResTime" : 6.0,
    "maxResTime" : 1131.0,
    "pct1ResTime" : 87.9,
    "pct2ResTime" : 112.39999999999986,
    "pct3ResTime" : 1131.0,
    "throughput" : 19.334880123743233,
    "receivedKBytesPerSec" : 75.81010126643466,
    "sentKBytesPerSec" : 2.8889029872389793
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 753,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58.01593625498011,
    "medianResTime" : 33.0,
    "minResTime" : 3.0,
    "maxResTime" : 1131.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 122.59999999999991,
    "pct3ResTime" : 940.880000000001,
    "throughput" : 154.65187923598276,
    "receivedKBytesPerSec" : 604.9191954200041,
    "sentKBytesPerSec" : 23.10415703943315
  },
  "推荐列表-并发" : {
    "transaction" : "推荐列表-并发",
    "sampleCount" : 200,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 74.39499999999997,
    "medianResTime" : 46.5,
    "minResTime" : 7.0,
    "maxResTime" : 1131.0,
    "pct1ResTime" : 96.0,
    "pct2ResTime" : 132.44999999999987,
    "pct3ResTime" : 1049.0600000000018,
    "throughput" : 84.35259384226066,
    "receivedKBytesPerSec" : 330.7379533951919,
    "sentKBytesPerSec" : 12.603463728384648
  },
  "收件箱-缓存查看" : {
    "transaction" : "收件箱-缓存查看",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.0,
    "medianResTime" : 15.0,
    "minResTime" : 15.0,
    "maxResTime" : 15.0,
    "pct1ResTime" : 15.0,
    "pct2ResTime" : 15.0,
    "pct3ResTime" : 15.0,
    "throughput" : 66.66666666666667,
    "receivedKBytesPerSec" : 27.408854166666668,
    "sentKBytesPerSec" : 9.505208333333334
  },
  "收件箱-索引统计" : {
    "transaction" : "收件箱-索引统计",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 149.0,
    "medianResTime" : 149.0,
    "minResTime" : 149.0,
    "maxResTime" : 149.0,
    "pct1ResTime" : 149.0,
    "pct2ResTime" : 149.0,
    "pct3ResTime" : 149.0,
    "throughput" : 6.7114093959731544,
    "receivedKBytesPerSec" : 2.320155201342282,
    "sentKBytesPerSec" : 0.9306837248322148
  },
  "收件箱-降级推荐" : {
    "transaction" : "收件箱-降级推荐",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 928.0,
    "medianResTime" : 928.0,
    "minResTime" : 928.0,
    "maxResTime" : 928.0,
    "pct1ResTime" : 928.0,
    "pct2ResTime" : 928.0,
    "pct3ResTime" : 928.0,
    "throughput" : 1.0775862068965516,
    "receivedKBytesPerSec" : 4.225106074892241,
    "sentKBytesPerSec" : 0.16416352370689655
  }
}